#3. Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт 
# номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

X = int(input('Введите X, не равным "0":'))
Y = int(input('Введите Y, не равным "0":'))

if X > 0 and Y > 0:
    print('I четверть')
elif X < 0 and Y > 0:
    print('II четверть')
elif X < 0 and Y < 0:
    print('III четверть')
elif X > 0 and Y < 0:
    print('IV четверть')
else:
    print('Значение должно быть не равно "0"!')

